# -*- coding: utf-8 -*-

item = {"source": '', "pubDate": 1558263600,
        "title": "晚间重要公告汇总 5月19日晚间，沪深两市多家上市公司发布公告，以下是重要公告汇总，供投资者参考：<br /><br />重大事项<br />东方创业：重组置入荣恒公司和外贸公司100%股权，聚焦贸易及现代物流产业；<br />中国巨石：巨石美国项目顺利建成；<br />通用股份：拟与红豆股份、红豆基金及翌沣投资出资设立合伙企业，投资新材料领域；<br />大业股份：拟1.2亿元投建分布式光伏发电项目；<br />聚隆科技：领泰基石拟要约收购13%股份，以获取公司控制权；<br />景峰医药：子公司通过兽药GMP认证；<br />莱茵生物：拟在美国投建工业大麻提取及应用项目；<br />海南橡胶：拟与华侨城海南公司共同打造国家橡胶公园；<br />环球印务：拟收购北京金印联70%股权；<br />恩捷股份：与LG化学签署逾6亿美元购销合同；<br />恺英网络：总经理陈永聪涉嫌操纵证券市场罪 正接受公安机关调查；<br />红豆股份：设立合伙企业投资石墨烯改性新材料等军民融合项目；<br /><br />增减持<br />迪威迅：控股股东所持股票被动减持达到1%；<br />新坐标：董监高股东拟减持不超过0.13%；<br /><br />问询函<br />*ST康得：年报问询函将延期至5月29日前回复；<br />飞乐音响收年报问询函 要求对公司持续盈利能力进行分析说明；<br /><br />资产重组",
        "content": " 5月19日晚间，沪深两市多家上市公司发布公告，以下是重要公告汇总，供投资者参考：<br /><br />【重大事项<br />东方创业：重组置入荣恒公司和外贸公司100%股权，聚焦贸易及现代物流产业；<br />中国巨石：巨石美国项目顺利建成；<br />通用股份：拟与红豆股份、红豆基金及翌沣投资出资设立合伙企业，投资新材料领域；<br />大业股份：拟1.2亿元投建分布式光伏发电项目；<br />聚隆科技：领泰基石拟要约收购13%股份，以获取公司控制权；<br />景峰医药：子公司通过兽药GMP认证；<br />莱茵生物：拟在美国投建工业大麻提取及应用项目；<br />海南橡胶：拟与华侨城海南公司共同打造国家橡胶公园；<br />环球印务：拟收购北京金印联70%股权；<br />恩捷股份：与LG化学签署逾6亿美元购销合同；<br />恺英网络：总经理陈永聪涉嫌操纵证券市场罪 正接受公安机关调查；<br />红豆股份：设立合伙企业投资石墨烯改性新材料等军民融合项目；<br /><br />【增减持<br />迪威迅：控股股东所持股票被动减持达到1%；<br />新坐标：董监高股东拟减持不超过0.13%；<br /><br />【问询函<br />*ST康得：年报问询函将延期至5月29日前回复；<br />飞乐音响收年报问询函 要求对公司持续盈利能力进行分析说明；<br /><br />【资产重组<br />东方创业：重大资产重组工作尚未完成 股票复牌；<br />我爱我家：终止重大资产重组事项。",
        "timestamp": 1558264067}

print(item.get('source','null') )



